it/test/resources/acknowledgement-requests/coe_request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ccn2="http://ccn2.ec.eu/CCN2.Service.Platform.Acknowledgement.Schema">
    <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <wsa:Action>CCN2.Service.Platform.AcknowledgementService/CoE</wsa:Action>
        <wsa:From>
            <wsa:Address>theEU</wsa:Address>
        </wsa:From>
        <wsa:RelatesTo RelationshipType="http://ccn2.ec.eu/addressing/err">980011b8-63df-42d4-991c-41459fca2054</wsa:RelatesTo>
        <wsa:MessageID>7da8f6c4-a034-419b-ba54-996167ceaf60</wsa:MessageID>
        <wsa:To>HMRC</wsa:To>
    </soap:Header>
    <soap:Body>
        <ccn2:CoE>
            <ccn2:Severity>?</ccn2:Severity>
            <ccn2:EventTimestamp>2021-06-14T09:42:33Z</ccn2:EventTimestamp>
            <!--Optional:-->
            <ccn2:Payload>
                <soap:Fault>
                    <soap:Code>
                        <soap:Value>?</soap:Value>
                    </soap:Code>
                    <soap:Reason>
                        <soap:Text xml:lang="?">?</soap:Text>
                    </soap:Reason>
                    <soap:Node>?</soap:Node>
                    <soap:Role>?</soap:Role>
                    <soap:Detail>
                    </soap:Detail>
                </soap:Fault>
                <ccn2:Message>?</ccn2:Message>
            </ccn2:Payload>
        </ccn2:CoE>
    </soap:Body>
</soap:Envelope>